In [4]:
import pandas as pd
df = pd.read_excel("titanic.xlsx")
df.head()

,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [6]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [9]:
dummies = pd.get_dummies(inputs.Sex)
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  female
0       3  22.0   7.2500       0       0
1       1  38.0  71.2833       1       1
2       3  26.0   7.9250       1       1

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  female
0       3  22.0   7.2500       0       0
1       1  38.0  71.2833       1       1
2       3  26.0   7.9250       1       1
3       1  35.0  53.1000       1       1
4       3  35.0   8.0500       0       0

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [24]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7947761194029851

In [25]:
print(X_test[0:10])
print(model.predict(X_test[0:10]))

     Pclass        Age      Fare  female  female
240       3  29.699118   14.4542       1       1
668       3  43.000000    8.0500       0       0
546       2  19.000000   26.0000       1       1
79        3  30.000000   12.4750       1       1
44        3  19.000000    7.8792       1       1
890       3  32.000000    7.7500       0       0
307       1  17.000000  108.9000       1       1
524       3  29.699118    7.2292       0       0
884       3  25.000000    7.0500       0       0
573       3  29.699118    7.7500       1       1
[1 0 1 1 1 0 1 0 0 1]

In [26]:
model.predict_proba(X_test[:10])

array([[8.96318024e-02, 9.10368198e-01],
       [9.90079559e-01, 9.92044103e-03],
       [3.60540735e-02, 9.63945926e-01],
       [8.95420499e-02, 9.10457950e-01],
       [7.50361922e-02, 9.24963808e-01],
       [9.90314311e-01, 9.68568858e-03],
       [3.17209035e-04, 9.99682791e-01],
       [9.90128509e-01, 9.87149082e-03],
       [9.89563683e-01, 1.04363170e-02],
       [8.76294705e-02, 9.12370529e-01]])

**Calculate the score using cross validation**

In [27]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.768     , 0.744     , 0.792     , 0.83870968, 0.73387097])